Revit 2027 API
FailureMessageAccessor.GetAdditionalElementIds Method
 Retrieves Ids of Elements that have not caused the failure but are related to it Checks if the failure has resolution of a given resolution type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetAdditionalElementIds()
Public Function GetAdditionalElementIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetAdditionalElementIds()
member GetAdditionalElementIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 Ids of Elements related to the failure
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace